#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ssh-key.random_pet.ssh_key_name: Refreshing state... [id=sshtruecollie]
data.azurerm_client_config.current: Reading...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYTJhN2JlYy0zZDA4LTQxYWEtYTZmYy03ZjZjZmQ3M2NmYWQ7b2JqZWN0SWQ9OTJmNTgyZjQtOTE4ZC00YTRiLTgwNWItNjM2ZDZmODNiNTcyO3N1YnNjcmlwdGlvbklkPWI0MTY3NzA3LTE0ODYtNDAxYS1iYTliLWZiMGZiMDg0MTExNDt0ZW5hbnRJZD02YjdkM2ExZC00YmU2LTQxN2YtOTI5Zi0zN2IwMTE5YmE3OTk=]
module.ssh-key.azapi_resource.ssh_public_key: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie]
module.azure-monitor-workspace.azurerm_monitor_workspace.workspace: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks]
module.am-dce.azurerm_monitor_data_collection_endpoint.dce: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionEndpoints/MSProm-australiaeast-dev-velidaaks]
module.user_assigned_identity.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks]
module.managed-grafana.azurerm_dashboard_grafana.grafana: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks]
module.network_contributor_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/71a5a7f7-cf55-2f75-1eed-70202f8ac8aa]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks]
module.grafana_admin_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks/providers/Microsoft.Authorization/roleAssignments/b4057ebd-d2ce-af8b-5eec-d63f64d1b1d1]
module.monitoring_data_reader_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/f32cb0cd-cbea-6c4a-aaf4-7f1eb3f0dd39]
module.am-dcr.azurerm_monitor_data_collection_rule.dcr: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-velidaaks]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/b54f8bf1-ac8a-6f7b-79a4-5f4034bb371b]
module.ssh-key.azapi_resource_action.ssh_public_key_gen: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie/generateKeyPair]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks]
module.dapr-extension.azurerm_kubernetes_cluster_extension.ext: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks/providers/Microsoft.KubernetesConfiguration/extensions/dapr]
module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.AlertsManagement/prometheusRuleGroups/NodeRecordingRulesRuleGroup-dev-velidaaks]
module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.AlertsManagement/prometheusRuleGroups/KubernetesRecordingRulesRuleGroup-dev-velidaaks]
module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks/providers/Microsoft.Insights/dataCollectionRuleAssociations/dcra-dcr-prometheus-aks]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.acr.azurerm_container_registry.acr has been deleted
  - resource "azurerm_container_registry" "acr" {
      - id                            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks" -> null
        name                          = "devacrvelidaaks"
        tags                          = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acr_pull_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/b54f8bf1-ac8a-6f7b-79a4-5f4034bb371b" -> null
        name                                   = "b54f8bf1-ac8a-6f7b-79a4-5f4034bb371b"
        # (9 unchanged attributes hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.aks has been deleted
  - resource "azurerm_kubernetes_cluster" "aks" {
      - id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks" -> null
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
        name                                = "dev-velidaaks"
        tags                                = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace has been deleted
  - resource "azurerm_monitor_workspace" "workspace" {
      - id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks" -> null
      - name                                = "dev-amw-velidaaks" -> null
        tags                                = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (6 unchanged attributes hidden)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks/providers/Microsoft.Authorization/roleAssignments/b4057ebd-d2ce-af8b-5eec-d63f64d1b1d1" -> null
        name                                   = "b4057ebd-d2ce-af8b-5eec-d63f64d1b1d1"
        # (9 unchanged attributes hidden)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana has been deleted
  - resource "azurerm_dashboard_grafana" "grafana" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks" -> null
        name                                   = "dev-grafana-velidaaks"
        tags                                   = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (12 unchanged attributes hidden)

      - identity {
          - principal_id = "a27e07bd-3a94-4e5e-acfe-b772e5fa0932" -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/f32cb0cd-cbea-6c4a-aaf4-7f1eb3f0dd39" -> null
        name                                   = "f32cb0cd-cbea-6c4a-aaf4-7f1eb3f0dd39"
        # (9 unchanged attributes hidden)
    }

  # module.ssh-key.azapi_resource.ssh_public_key has been deleted
  - resource "azapi_resource" "ssh_public_key" {
      - id                        = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie" -> null
        name                      = "sshtruecollie"
        # (9 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi has been deleted
  - resource "azurerm_user_assigned_identity" "msi" {
      - id                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks" -> null
        name                = "dev-uai-velidaaks"
      - principal_id        = "5329bd6a-8950-4245-aaf2-d8274f6edc37" -> null
        tags                = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "australiaeast"
      + login_server                  = (known after apply)
      + name                          = "devacrvelidaaks"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-velidaaks"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.acr_pull_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "dev-velidaaks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "australiaeast"
      + name                                = "dev-velidaaks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-velidaaks"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2s_v3"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity (known after apply)

      + linux_profile {
          + admin_username = "willvelida"

          + ssh_key {
              + key_data = (known after apply)
            }
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip          = (known after apply)
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "kubenet"
          + network_policy          = (known after apply)
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = (known after apply)
          + service_cidrs           = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)

      + workload_autoscaler_profile {
          + keda_enabled                              = true
          + vertical_pod_autoscaler_controlled_values = (known after apply)
          + vertical_pod_autoscaler_enabled           = false
          + vertical_pod_autoscaler_update_mode       = (known after apply)
        }
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be updated in-place
  ~ resource "azurerm_monitor_data_collection_rule" "dcr" {
        id                          = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-velidaaks"
        name                        = "MSProm-australiaeast-dev-velidaaks"
        tags                        = {}
        # (6 unchanged attributes hidden)

      ~ destinations {
          ~ monitor_account {
              ~ monitor_account_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks" -> (known after apply)
                name               = "dev-amw-velidaaks"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {
      + data_collection_rule_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-velidaaks"
      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"
      + id                      = (known after apply)
      + name                    = "dcra-dcr-prometheus-aks"
      + target_resource_id      = (known after apply)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created
  + resource "azurerm_monitor_workspace" "workspace" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "australiaeast"
      + name                                = "dev-amw-velidaaks"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "rg-velidaaks"
      + tags                                = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
    }

  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created
  + resource "azurerm_kubernetes_cluster_extension" "ext" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = (known after apply)
      + current_version       = (known after apply)
      + extension_type        = "Microsoft.Dapr"
      + id                    = (known after apply)
      + name                  = "dapr"
      + release_namespace     = (known after apply)
      + release_train         = "Stable"
      + target_namespace      = (known after apply)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ef4778b-9110-4e3b-8390-6ab10d2f1607"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "australiaeast"
      + name                                   = "dev-grafana-velidaaks"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "rg-velidaaks"
      + sku                                    = "Standard"
      + tags                                   = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.network_contributor_role.azurerm_role_assignment.role must be replaced
-/+ resource "azurerm_role_assignment" "role" {
      ~ id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/71a5a7f7-cf55-2f75-1eed-70202f8ac8aa" -> (known after apply)
      ~ name                                   = "71a5a7f7-cf55-2f75-1eed-70202f8ac8aa" -> (known after apply)
      ~ principal_id                           = "5329bd6a-8950-4245-aaf2-d8274f6edc37" -> (known after apply) # forces replacement
      ~ role_definition_id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {
      + cluster_name        = "dev-velidaaks"
      + description         = "Kubernetes Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "KubernetesRecordingRulesRuleGroup-dev-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)
            EOT
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)
            EOT
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {
      + cluster_name        = "dev-velidaaks"
      + description         = "Node Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "NodeRecordingRulesRuleGroup-dev-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})
            EOT
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))
            EOT
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})
            EOT
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})
            EOT
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_vmstat_pgmajfault{job="node"}[5m])
            EOT
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

  # module.ssh-key.azapi_resource.ssh_public_key will be created
  + resource "azapi_resource" "ssh_public_key" {
      + body                      = jsonencode({})
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "australiaeast"
      + name                      = "sshtruecollie"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.Compute/sshPublicKeys@2022-11-01"
    }

  # module.ssh-key.azapi_resource_action.ssh_public_key_gen must be replaced
-/+ resource "azapi_resource_action" "ssh_public_key_gen" {
      ~ id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie/generateKeyPair" -> (known after apply)
      ~ output                 = {
          - privateKey = <<-EOT
                -----BEGIN RSA PRIVATE KEY-----
                MIIG5AIBAAKCAYEAuJXWUSO7bEn0zRIzKfBYqdllEjKBeG+HvNX80ARBxwbDd0Vr
                taJ44ra1NDFXIRwA2OV6YA2CnByG90QZpBw4idUBnFzx3LHb/joiMnMAPBY0ChgT
                hiPfAv4N6uIPesRqV0r7xXTRjytLL9YkMlK18w1R3SkdjAzHjAei8QpvMd1vr+f7
                j8lDm1kH+RDdGVvPR0c0qpHNgL5YnUfJXkqmiOGcc5DjsFNdv6GtGcRX9dypt6ar
                w3LhS2GHmM9v3fGkxkFGqgpy4f7wP0ATYieY1IsqwsDIbnfJgQE8tE48fR/jTg35
                rSyjkagORztNKPNYgcabzWOyoOtIi9XU/ODywHuY4J9LVnpkTl3y3zyrTMTjICwU
                +uXD26AYspBTd9EDk0rY8TtFcVTz7ji+ZVdo8xfghgMLlleAfacmbz94lmqacjuU
                IYvICmBE9JVqWQeXrFB43ifzEVu+ZhQ74gOzNi1lREwjeiSBDZSqRLccI8KE4rc0
                bhleTYg2CkREqNM5AgMBAAECggGBALNYuuUZn9imvxml7lp4cd2OIdsdgZjAXRXI
                oRyIllTIKJGxvOa9l1FJDyVIL403BUe5KD89wULnoOeNnpBK71BUy3ze/g1eLw+D
                8ogsHvVC6YtJO2chYWUp7eHjhgDV6TEp5RlE2PyPpz0yhvbyUGF49qq5cUELhbN0
                FAi6B7Jeok87Sry5ZFwDlHCWxw0FnI94Cx8UDaVizPz8rBZW2Bq1g2ryQ5imV7eD
                YopfsMttfOW5Jrj/3RF+EN8T5nCygK2mnjcrgKDDsRhv589W8PpRYpiAPaGuLF6b
                wtIi6U35eqCijyI9hqUCiIKRjffdDdpHhB9DeWOoms0o0vtwczwlqHDeLcqzfRlY
                wt2KuLzdsPyLhXTVKA9XL2z+Lm8t4TpK++ejOgDsYfWnL9/XJMe3ubMwRAOCUGU3
                hYuwk4tr9JHw5vl+Z5SoRufkVQPwS1nIkmyEuu8iS1z+Rfcncq6IAt9+4YEfyFMR
                04W4VvaQeqmeqMSggK/uo58piD76lQKBwQDe02t4rvyzY9Cu7Jr9tyq8Im0lR8CH
                oEbATJzLQAu08ujhp8+ilH5/gZK0aw8Ik5iDDitndOBGwJin4sLBIlqwcMFLNUpu
                IXonylBOWriUpiUgCRhsh0yVGZknLqI1+UmzLifdnSYUoGg+sBu4txeq1HZYSQee
                kuSDVTmHk+PiO9B+/ZJDQ7A4OVglBpEJc89Zzv+oDlkP+CX9U8ew16Ps2K4+OGWQ
                QWDrYDwU1aNp+OCJ86LgHmMZh0Spgt0txzMCgcEA1BDzrmXAGRia6vWfqFOo2thQ
                7lqHRNMvSdQ/HDkFXP7iF5ktuYrpFP3wpNgcvHxeF3CTI21G+/vCqYAAfaOr4mJk
                xST9FK2M8/dAwEaDuYV9RNZdJGVOC6CM9qYHD5BMys7GD18ofdnaunwCdi3r85Dc
                JWmtXygPQON082KG+XyNqY1roOLgwC+aQvB6W8on4FBSEcWk4HhRZMTlfoNFw/aK
                wygHOkSKE67TZUhme2cuHh5hn6Hk9xU6HzM0dgvjAoHBAJtq3WgUrV82PKT1lPlo
                G5+TZ4t8K3atvQt9pFNDvaadUv+pu3JLnpuyta+viJHT2Kl4ZZ/IbnIK/a8DxBFP
                s++jBb8+UUbVhM1iGHc+YcYUyIo6rdVs3WaVrzQcG7oHwXb/t4Ckjp4OcAdhcER7
                OD/H5y+W6ICbNlXASNsetPDkBX29wZm3CZ99p9RTazArnbGnZrxCHa68x0qVeBAJ
                qGWXkJkHXxep8j7aJa3mgQ92Lq8pxy4JI9f3eFW/WCQI7wKBwD9+S9d9c4SQD2Il
                5IWbdsT/W0viIvoCWPg76iFjGS38ymjSXhRdeOfmGDTi18e/XNSbyhIjV8t+V4w0
                XPFBHeeMGivEpVmZlMg+0U5ATpQvWZBQtlZ9Vl641TvL/fU0+SkHu9lCXnc/0PNg
                ycPkf+7PAnrZJyWEcvy0nYF5kHwGRMvtIbpr82rXVdKQ+bGd106b/daAXJswqv4G
                zceROkQv/t/rji5t8wFtqLF8eeKcw/wUkJog+NLZsitBQ4XMjQKBwHVfoSHwsXw7
                Vw/AtqRABbqJKKuU0JeE2TLolGEr2VPnD83FCgWcPb+L6me7nNMdMorXvkGFn2zS
                gtWYydiSMtgXdqEBUs48fT9h3E6OYBVl5/EAwOfMgBKhdTjLCGtoZWsRUtE47O9X
                vb4SfjUn+8K1F121LQHwErR/tsgjo40t7Jv/5mafT5Ldpdf5eAnpMxQao9Awidkl
                aD4r4K5r6asGs23FWF5n57wo4rXeZmkw25T0MqhdIuKYzHGJNfD1mw==
                -----END RSA PRIVATE KEY-----
            EOT
          - publicKey  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC4ldZRI7tsSfTNEjMp8Fip2WUSMoF4b4e81fzQBEHHBsN3RWu1onjitrU0MVchHADY5XpgDYKcHIb3RBmkHDiJ1QGcXPHcsdv+OiIycwA8FjQKGBOGI98C/g3q4g96xGpXSvvFdNGPK0sv1iQyUrXzDVHdKR2MDMeMB6LxCm8x3W+v5/uPyUObWQf5EN0ZW89HRzSqkc2AvlidR8leSqaI4ZxzkOOwU12/oa0ZxFf13Km3pqvDcuFLYYeYz2/d8aTGQUaqCnLh/vA/QBNiJ5jUiyrCwMhud8mBATy0Tjx9H+NODfmtLKORqA5HO00o81iBxpvNY7Kg60iL1dT84PLAe5jgn0tWemROXfLfPKtMxOMgLBT65cPboBiykFN30QOTStjxO0VxVPPuOL5lV2jzF+CGAwuWV4B9pyZvP3iWappyO5Qhi8gKYET0lWpZB5esUHjeJ/MRW75mFDviA7M2LWVETCN6JIENlKpEtxwjwoTitzRuGV5NiDYKRESo0zk= generated-by-azure"
        } -> (known after apply)
      ~ resource_id            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "dev-uai-velidaaks"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-velidaaks"
      + tags                = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
      + tenant_id           = (known after apply)
    }

Plan: 15 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ kube_config         = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*